In [5]:
data = {
    'olma' : [3, 2, 10, 1],
    'mandarin' : [20, 3,  2, 7]
}

In [22]:
data

{'olma': [3, 2, 10, 1], 'mandarin': [20, 3, 2, 7]}

In [7]:
import pandas as pd 

df = pd.DataFrame(data)

In [8]:
df

   olma  mandarin
0     3        20
1     2         3
2    10         2
3     1         7

In [9]:
df2 = pd.read_csv(r'C:\Users\User\Desktop\IT\AI_python\Pandas\fruit.csv')

In [10]:
df2

    cherry  strawberry
0      1.0        10.0
1      2.0         NaN
2      3.0        30.0
3      4.0        40.0
4      NaN        50.0
5      6.0        60.0
6      7.0        70.0
7      8.0         NaN
8      NaN        90.0
9     10.0       100.0
10    11.0       110.0
11     NaN       120.0
12    13.0       130.0
13    14.0         NaN

In [26]:
df3 = pd.DataFrame(data, index=['Jon', 'Smith', 'Mike', 'MedMax'])

In [27]:
df3

        olma  mandarin
Jon        3        20
Smith      2         3
Mike      10         2
MedMax     1         7

In [30]:
df3.loc["Jon"]

olma         3
mandarin    20
Name: Jon, dtype: int64